#language: ru

Функционал: <Тестовая фича для проверки работоспособности пайплайна. Открывается программа, справочник контрагентов и потом все закрывается>

Как ci-bot я ввожу пароль 123
Я хочу чтобы открылась программа, открылся справочник контрагентов и потом все закрылось
Чтобы протестировать работу пайплайна

Контекст:
	Дано Я подключаю клиент тестирования с параметрами:
    | 'Имя подключения' | 'Имя компьютера' | 'Порт' | 'Строка соединения' | 'Логин'      | 'Пароль'     | 'Тип клиента'| 'Запускаемая обработка' |  'Дополнительные параметры строки запуска'  |
    | 'Test 1'          | 'localhost'      | 		| ''                  | 'ci-bot'     | '123'  		| 'Тонкий'     |                         |                                             |


Сценарий: <описание сценария>

	Когда Я нажимаю кнопку командного интерфейса 'Справочники'
	И Я нажимаю кнопку командного интерфейса "Контрагенты"
	Тогда открылось окно 'Контрагенты'
	И Я закрываю окно 'Контрагенты'
	И Я закрываю сеанс TESTCLIENT
